# Ваша компанія веде блог. Треба реалізувати функцію find_articles для пошуку за статтями цього блогу. 
# Є список articles_dict, в якому міститься опис статей блогу.
# Кожен елемент цього списку є словником з наступними ключами: прізвища авторів - ключ 'author', назва статті - ключ 'title', рік видання - ключ 'year'.
# Реалізуйте функцію find_articles,
# Параметр key функції визначає поєднання букв для пошуку. 
# Наприклад, при key="Python" функція шукає, чи є у списку articles_dict статті, у назві чи іменах авторів яких зустрічається це поєднання літер. 
# Якщо такі елементи списку були знайдені, треба повернути новий список зі словників, що містять прізвища авторів, назву та рік видання всіх таких статей.
# Другий ключовий параметр функції letter_case визначає, чи треба враховувати під час пошуку регістр літер. 
# За умовчанням він дорівнює False і регістр немає значення тобто пошук в тексті "Python" і "python" це те ж саме.
# Інакше потрібно шукати повний збіг.