"""
Метод: isdigit
​
Різниця між isdigit(), isnumeric() and isdecimal()
+-------------+-----------+-------------+-------------------------------------+
| isdecimal() | isdigit() | isnumeric() |          Example                    |
+-------------+-----------+-------------+-------------------------------------+
|  True       |    True   |    True     | "038", "੦੩੮", "０３８"               |
|  False      |    True   |    True     | "⁰³⁸", "🄀⒊⒏", "⓪③⑧"            |
|  False      |   False   |    True     | "↉⅛⅘", "ⅠⅢⅧ", "⑩⑬㊿", "壹貳參"   |
|  False      |   False   |   False     | "abc", "38.0", "-38"                |
+-------------+-----------+-------------+--------------------------------------+
1. Знайти кількість цифр у рядку
2. Знайти кількість чисел у рядку
"""