"""
Метод: format
-------------
<   :  left-align text in the field
^   :  center text in the field
>   :  right-align text in the field
-------------
Перша цифра у номері пластикової картки означає, до якої платіжної системи вона належить. Усі картки Visa мають
номер, що починається на "4", Mastercard - на "5", а American Express - "3". Якщо картку видала не кредитна
організація, номер може починатися з інших цифр. "1" і "2" - це різні авіалінії, "3" - організації сфери
подорожей та розваг, «6» - мерчендайзингові компанії, «7» - паливні, «8» - підприємства у сфері
телекомунікацій, а «9» - це державні асигнації.
"""