# Для минулого завдання додамо клас Owner — власника собаки. У
# класу є три атрибути: ім'я — name, вік — age та адреса — address. Також необхідно реалізувати метод info, який повертає словник з ключами 'name', 'age' і 'address', та значення яких дорівнюють відповідним властивостям екземпляра класу.
#
# Реалізувати для класу Dog атрибут owner, який буде екземпляром класу Owner.
# Додати до класу Dog метод who_is_owner, який повертає результат виклику методу info екземпляра класу Owner, тобто це словник з ключами name,