# Розрахунок прибутку.
# Припустимо, що підприємство друкує рекламні листівки за ринковою ціною "p".
# Надійшло велике замовлення, яке потрібно виконати, потрібно виготовити n-ну кількість листівок.
# Товар виробляється в кількостях кратних 100, тобто замовити можна від 100, 200, 300 і т.д. листівок
# Для виробництва 100 листівок витрати будуть такого характеру:
# - майстер із друку (якому за 100 листівок платять 75 грн),
# - 100 аркушів спецпаперу (коштує 120 грн)
# - витрата чорнила на 100 аркушів паперу (20 грн).
# Порахуйте, скільки компанія заробить залежно від ціни та кількості замовлених рекламних листівок
#
# Пам'ятайте, що прибуток рахується як виручка мінус витрати, де витрати це гроші,
# витрачені на роботу (людей) і матеріали
# p - ринкова ціна однієї листівки
# n - Кількість, яку потрібно надрукувати