# Скласти програму, яка вводить з клавіатури тризначне число і виводить на екран:
# - суму останньої та передостанньої цифри
# - суму останньої та першої цифри
print("Ця программа обчислює сумму останьої та передостанньох цифрі та сумму останньої та першої цифри  та першої та другої цифри")

while True:
    mine = int(input("Введіть трехзначне число: "))
    first_numbers = mine % 10
    second_numbers = mine // 10 % 10 
    thith_numbers = mine // 100 % 10 

    suma_1_2 = first_numbers + second_numbers
    suma_3_2 = thith_numbers + second_numbers
    suma_3_1 = thith_numbers + first_numbers

    print(f"Сумма першої та другої цифри вашого числа дорівнює: {suma_3_2}")
    print(f"Сумма останньої та другої цифри вашого числа дорівнює: {suma_1_2}")
    print(f"Сума першої та останньої цифри вашего числа: {suma_3_1}")