# Для кава-брейків на конференції закуплено:
# х круасанів, у стаканчиків, z упаковок кави.
# Ціна круасана $1.04, ціна стаканчика - $0.34, ціна упаковки кави $4.42
# Скласти програму, яка обчислює,
# скільки повних доларів пішло на закупівлю їжі для кава-брейків, і яка її вартість у центах.

print("Программа дозволяє вирахувати скільки долларів пішло за закупівлю їжі для кава-брейків")
cost_cruasan = 1.04
cost_cup = 0.34
cost_coffee = 4.42

while True:
    cruasan = int(input("Введіть кількість круасанів:"))
    cup = int(input("Введіть кількість стаканчиків:"))
    coffee = int(input("Введіть кількість упаковок кави:"))

    suma = (cost_cruasan * cruasan) + (cost_cup * cup) + (cost_coffee * coffee) 
    dollar = int(suma)
    cent = (suma - int(suma)) * 100
    cent = int(cent)
    
    

    print(f"На закупівлю їжі для кава-брейків пішло {dollar}$  та {cent} центів")
    
