# В Інтернет-магазині зроблено 4 покупки: на $34.34, $12.01, $17.42, $4.93.
# Зі скількох доларів і центів складатиметься підсумкова сума.
print("Вітаю ця программа рахує ваші покупки та  виводить сумму в долларах та сентах")
while True:
    bay_1 = float(input("Введіть ціну першої покупки:"))
    bay_2 = float(input("Введіть ціну другої покупки:"))
    bay_3 = float(input("Введіть ціну третьої покупки:"))
    bay_4 = float(input("Введіть ціну останньої покупки:"))
    
    suma = bay_1 + bay_2 + bay_3 + bay_4
    dollar = int(suma)
    cent = (suma - int(suma))* 100
    cent = int(cent)

    print(f"Сума вашої покупки дорівнює {dollar}долларів та {cent}центів")

