# Розрахунок прибутку.
# Припустимо, що підприємство друкує рекламні листівки за ринковою ціною "p".
# Надійшло велике замовлення, яке потрібно виконати, потрібно виготовити n-ну кількість листівок.
# Товар виробляється в кількостях кратних 100, тобто замовити можна від 100, 200, 300 і т.д. листівок
# Для виробництва 100 листівок витрати будуть такого характеру:
# - майстер із друку (якому за 100 листівок платять 75 грн),
# - 100 аркушів спецпаперу (коштує 120 грн)
# - витрата чорнила на 100 аркушів паперу (20 грн).
# Порахуйте, скільки компанія заробить залежно від ціни та кількості замовлених рекламних листівок
#
# Пам'ятайте, що прибуток рахується як виручка мінус витрати, де витрати це гроші,
# витрачені на роботу (людей) і матеріали
# p - ринкова ціна однієї листівки
# n - Кількість, яку потрібно надрукувати
price = input("Enter price: ")
n = input("Enter amount: ")
n = int(n)
price = int(price)


def profit(price,n,masta=75,paper=120,chch=20):
    if n % 100 != 0:
        print(f"Можна замовити тільки число листівок кратне 100")
        return
    n_hundred = n // 100
    return price * n - n_hundred * ( masta + paper + chch)

print(profit(price,n))