# Компанії платять податки.
# При чому розмір податку, найчастіше залежить від прибутку (податок на прибуток). Припустимо гіпотетично, що
# якщо прибуток компанії склав до 100 000, компанія повинна заплатити 5% від нього,
# якщо прибуток до 1 000 000, податок становить 8%,
# якщо прибуток більший за 10 000 000, компанія платить 15% податок.
# Використовуйте функцію з попереднього завдання, щоб порахувати,
# який буде прибуток компанії після сплати податків


def prifit(num):
    if num < 100_000 :
        nal = 0.05
    elif num < 1_000_000:
        nal = 0.08
    elif num > 10_000_000:
        nal = 0.15
    return num - num * nal

print(prifit(99_000))