# Дуже часто люди у своїх повідомленнях не ставлять великі літери, особливо це стало масовим явищем в еру мобільних. пристроїв. 
#Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом і повертатиме рядок з відновленими великими літерами.

# Функція повинна:

# зробити великою першу літеру в рядку, попри прогалини
# зробити великою першу літеру після точки, попри прогалини
# зробити великою першу літеру після знака оклику, попри прогалини
# зробити великою першу літеру після знака питання, попри прог
s = "  привет  как ? ваши ! дела  .    "
def capital_text(s):
    s = s.strip()
    s = s.capitalize()
    w = ""
    cap_text = None
    for char in s:
        if char == "." or char == "!" or char == "?" :
            cap_text = True
            w += char
        elif char.isalpha() and cap_text:
            w += char.upper()
            cap_text = False
        else:
            w += char
    return w


            
            

print(capital_text(s))

