# У четвертому модулі розв'язували завдання нормалізації даних. Розширимо її.

# При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі.
# Напишіть функцію data_preparation, яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

# Функція повинна видаляти з переданих списків найбільше і найменше значення, але якщо розмір списку понад два елементи.
# Після видалення даних з кожного списку необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути отриманий список 
# як результат (Для прикладу вище результат буде наступним: [6, 5, 4, 3, 2]).

a =  [[1, 2, 3, 0], [3], [5, 6, 1, 7, 2]]
def data_preparation(list_data):
    new_list = []
    for i in list_data:
        if len(i) > 2:
            i.sort()
            del i[0]
            del i[-1]
            new_list.extend(i)
        elif len(i) == 0 :
            continue
        elif len(i) == 1:
            new_list.extend(i)          
        else:
            a = i .pop(0)
            b = i.pop()
            new_list.append(a)
            new_list.append(b)
    sort_list = sorted(new_list, reverse=True)
    return sort_list 



        


print(data_preparation(a))
   